{"intents":  [
  {"tag": "greetings",
  "patterns": ["hello!", "Hi", "Hey", "Good day", "Greetings", "What's up", "How is it going"],
  "responses": ["Hello!", "Hey", "What can I do for you?"]
  },
  {"tag": "instructions",
  "patterns": ["Can you provide instructions about this chat?", "Can you tell me how to talk with you?",
    "How do I use this application?", "Can you explain how do you work?"],
  "responses": ["Of course. I am a prototype of chat that should help you get familiar with out company. \nYou can just ask me any question about anything regarding on-boarding and any other company related things. \nKeep in mind that I am not trained enough yet to remember context of previous questions."]
  },
  {"tag": "expired password",
  "patterns": ["Can you help me with my expired password?", "How can I deal with expired password?", "What to do when my password expires?", "What should I do when my password expires?",
    "How do I change the expired password", "Can you explain how to deal with expired password?", "Can you tell me how to change expired password?", "What happens when my windows password expire?"],
  "responses": ["At first logon windows will prompt you to change the password by entering the Hello PIN -> click OK. \nEnter the pin. If PIN is correct you should see a message that your password has expired. \nNow you need only to enter new password twice and it's done"]
  },
  {"tag": "forgotten password",
  "patterns": ["Can you help me with my forgotten password?", "How can I deal with forgotten password?",
    "How do I change the forgotten password", "Can you explain how to deal with forgotten password?", "Can you tell me how to change forgotten password?", "What happens when I forget my windows password?", "How can I change the forgotten windows password?"],
  "responses": ["In this situation you have to options: You can try to reset it via the IAG Portal in Citrix by yourself \n1. Login to https://Iam.group.euroclear.com/identityiq/ by inserting your RSA PIN (linked to your token) + RSA token code (This is called passcode) \n2. Click on the menu button at the top left corner. \n3. Click on manage Access and then manage passwords.\n4. Select the checkbox against 'Windows apps' and click change and then enter new password.\n Second option is to call 2424. You should have your personal questions set in advance to speed up the process. Follow the instructions provided by helpdesk then."]
  },
  {"tag": "workstation software request",
  "patterns": ["Can you help me request software to my workstation?", "How can I request software on my workstation?",
    "How to request software on my workstation", "Can you explain how to request programs on workstation?", "Can you tell me how do I request software on my machine", "How can I get additional software on my computer"],
  "responses": ["To get additional software you have to go check if it is present in the service now catalogue: \nif yes, you can select up to 10 software's and up to 10 workstations in single request. Installation will be finished in up to 2 working days. \nIf software is not present then you need an approval and it may take up to 6 weeks."]
  },
  {"tag": "bring your own device",
  "patterns": ["Can I access my email from other devices?", "Can you tell me if it is possible to access the email from other devices/phone?",
    "How can I check my email or calendar outside of my computer?", "Can I access my calendar or email from my phone?"],
  "responses": ["Yes, you can use your phone. You need to raise a request in service now (BYOD - bring your own device).\n If you'll get the approve, support team will provide you with a unique code, that will be valid for 4 hours. \nFirst you have to follow the link (link) and fill the PIN that you received from support and follow the instructions on the screen."]
  },
  {"tag": "appshare drives",
  "patterns": [],
  "responses": ["To map an appshare drives you should follow the following steps: \n1. Open file explorer \n2. Click on your computer name \n3. In the top ribbon click 'Computer' \n4. Click map network drive \n5. Fill in the path to appshare folder"]
  },
  {"tag": "Jabra speaker phone in meeting room",
  "patterns": ["How can I fix speakers in meeting room?", "Why can't I hear anything from speakers in meeting room?", "Why speakers in meeting room do not work?", "Can I add speakers to meeting room?",
    "Can I switch to speakers in meeting room?", "How to connect meeting room speakers to my laptop?", "How can I connect meeting room speakers to my computer"],
  "responses": ["Not all of the meeting rooms are equipped with VTC's. To be able to have good sound in your meeting speaker, phones are provided in the other meeting rooms. \n If meeting room does not have VTC and speaker installed you can contact local on site support to install it. \nTo connect a speaker plug in the usb cable of the speaker in your laptop. \nDevice should be detected automatically. \nIf sound did not switch to speaker you have to change the device in your system manually under sound icon on the taskbar to 'Echo cancelling speaker phone'"]
  },
  {"tag": "printer setup",
  "patterns": ["Can I add printer to my computer?", "How to install printer in my laptop?", "Can you tell me how to print something from my computer?", "Help me with printing the documents",
    "Help me setup a printer in my laptop", "How can I setup printer"],
  "responses": ["You can setup printer by following the steps: \n1. Go to your start menu and search for 'Printer assignment tool'\n2. Open the tool, select the location, flor and printer ID. \n3. Select install printer - It will be assigned to your deevice. \nAlternatively you can do the same from Citrix"]
  },
  {"tag": "Helpdesk details",
  "patterns": ["What can I ask HelpDesk about?", "What is helpdesk responsible for?", "Can I ask Helpdesk about", "What are helpdesk responsibilities", "Can helpdesk help me with?", "What does helpdesk do?"],
  "responses": ["Helpdesk can help you with most of IT related incidents or requests that require first-level support. To ask call them you should call 2424.\nThey create and follow the IT related tickets in ServiceNow incident tickets and are in close level contact with second level support. \nHowever Helpdesk can't:\n - Grant accesses (to security groups, printers, shared drives etc).\n - Manage HR related issues\n - help you with tool usage - they don't provide instructions, etc."]
  },
  {"tag": "Token-less VPN/MFA logging",
  "patterns": ["How can I log to vpn if i lost my token?", "Can I log to VPN without my token?", "Is login to VPN possible if I lost my RSA token?", "What to do If I lost my RSA token", "What should I do when I lose my RSA token",
    "What to do when I want to log into VPN when I lost my rsa token?"],
  "responses": ["To connect remotely, without your token you can call 2424 - you will get emergency logon code. Then you can log to RSA self-service (Shortcut in edge in favorites).\n With your pin and generated code you can generate more temporary codes: \nClick on troubleshooting and then select Token is temporary unavailable.\nThen new prompt appears with a set of codes that you may export to file. Codes are valid for only 1 day"]
  },
  {"tag": "Citrix v8 logon",
  "patterns": ["How can I log on to Citrix?", "Where can I access my VDI", "Tell me how to access Citrix", "Can you help me accessing Citrix?", "Tell me how to login to Citrix"],
  "responses": ["To connect to Citrix open edge browser navigate to Euroclear and select Citrix folder. \nProceed to 'Store Front Prod' and click Log On. You can log on with your pin or with username and password.\n If you want to use username and password click on 'switch to user name and password' and type them in browser. \nIf you want to use pin Click log on, select VDI and type pin in new window"]
  },
  {"tag": "killing processes on vdi",
  "patterns": ["How to shut down frozen process on my VDI?", "Tell me how to kill frozen programs on VDI", "What to do when program freezes on my VDI?", "How can I fix frozen application on my Virtual machine?"],
  "responses": ["To kill frozen process on your VDI you need to open task manager, select process and click on End Task. \nTo open task manager you have to navigate to VDI's taskbar, since standard Ctrl-Alt-Delete combination will open you device's prompt"]
  },
  {"tag": "blocked citrix",
  "patterns": ["Why is my citrix account blocked?", "How can I unlock my citrix account?", "What to do when my citrix is blocked", "How can I unlock disabled citrix account?", "What can I do to fix disabled citrix account"],
  "responses": ["If you get the message that your account is blocked/disabled you have to contact helpdesk under 2424."]
  },
  {"tag": "Citrix server name",
  "patterns": ["How can I check Citrix server name?", "Where can I find Citrix server name?", "Where can i Get citrix server name?", "How to find citrix server name?"],
  "responses": ["If you are in Citrix V6 go to start menu - name is displayed between recent items and control panel.\n If session is in V8 then you can find an Icon that displays server name. It can also be found in the file explorer on panel on the left"]
  },
  {"tag": "service now selfhelp",
  "patterns": ["Where can I find selfhelp article?", "Are there any kind of self help articles?", "Can I find somewhere a description of solution for frequent problems?", "Do we have a FAQ for frequent problems?"],
  "responses": ["On service now portal you can find a knowledge section. It is very well organised - you can try to find solution to your problem\nby selecting proper categories and searching through articles."]
  },
  {"tag": "Outlook signature",
  "patterns": ["How can I create my outlook signature?", "Tell me how to make my own outlook signature", "Where can I change my outlook signature?", "How to create my corporal signature?", "can I create outlook signature?"],
  "responses": ["You can create your signature in citrix or your physical device. Open new email tab and select signatures.\nThen change the settings in new messages and replies/forwards.\nSelect Euroclear email signature for both options and click ok."]
  },
  {"tag": "Outlook distribution List",
  "patterns": ["How can I create outlook distribution List?", "How can I update outlook distribution List?", "Tell me how to add someone to distribution List", "How can I remove someone from distribution List?"],
  "responses": ["Distribution List can't be managed by its owner. Every distribution list change must be done through DSA tool inside lotus notes by raising a request. \nTo do so, create new request, select lotus notes as application since there is no Outlook App, \nselect what type of action you want to perform and add all necessary details. Once done you will be notified"]
  },
  {"tag": "",
  "patterns": [],
  "responses": []
  }
]}